backend/test_files/soap_invoice_request_digital.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
    <env:Body>
        <Invoice xmlns="http://testpos.elavirint.com/api/xml/schema">
            <SellerIdentificationNumber>02700786</SellerIdentificationNumber>
            <Type>1</Type>
            <DateCreated>2021-07-09T08:36:33+02:00</DateCreated>
            <ValueDate>2021-07-09T08:36:33+02:00</ValueDate>
            <TaxPeriod>06/2021</TaxPeriod>
            <PaymentTypeId>1</PaymentTypeId>
            <OperatorEfiCode>zh854mj949</OperatorEfiCode>
            <TotalBasePrice>1.00</TotalBasePrice>
            <TotalBasePriceWithRebateOnly>1.00</TotalBasePriceWithRebateOnly>
            <TotalBasePriceWithTaxOnly>1.21</TotalBasePriceWithTaxOnly>
            <TotalBasePriceWithRebateAndTax>1.21</TotalBasePriceWithRebateAndTax>
            <TaxAmount>0.21</TaxAmount>
            <RebateAmountBeforeVat>0</RebateAmountBeforeVat>
            <RebateAmountAfterVat>0</RebateAmountAfterVat>
            <CorrectionInvoiceIICReference></CorrectionInvoiceIICReference>
            <CurrencyIsoCode>EUR</CurrencyIsoCode>
            <CurrencyExchangeRate>1</CurrencyExchangeRate>
            <Note>Test</Note>
            <Buyer>
                <IdentificationTypeId>2</IdentificationTypeId>
                <IdentificationNumber>02482042</IdentificationNumber>
                <Name>Ulica Slobode d.o.o.</Name>
                <Adress>Ulica testna BB</Adress>
                <City>Podgorica</City>
                <CountryCode>MNE</CountryCode>
            </Buyer>
            <Items>
                <Item>
                    <Code>1</Code>
                    <Description>Test</Description>
                    <UnitBasePrice>1.00</UnitBasePrice>
                    <RebatePercentage>0.00</RebatePercentage>
                    <TaxPercentage>21.00</TaxPercentage>
                    <UnitBasePriceWithRebateOnly>1.00</UnitBasePriceWithRebateOnly>
                    <UnitBasePriceWithTaxOnly>1.21</UnitBasePriceWithTaxOnly>
                    <UnitBasePriceWithRebateAndTax>1.21</UnitBasePriceWithRebateAndTax>
                    <UnitOfMeasure>kom</UnitOfMeasure>
                    <Quantity>1</Quantity>
                    <TotalBasePrice>1.00</TotalBasePrice>
                    <TotalBasePriceWithRebateOnly>1.00</TotalBasePriceWithRebateOnly>
                    <TotalBasePriceWithTaxOnly>1.21</TotalBasePriceWithTaxOnly>
                    <TotalBasePriceWithRebateAndTax>1.21</TotalBasePriceWithRebateAndTax>
                    <TotalTaxAmount>0.21</TotalTaxAmount>
                    <TotalRebateAmountBeforeVat>0</TotalRebateAmountBeforeVat>
                    <TotalRebateAmountAfterVat>0</TotalRebateAmountAfterVat>
                    <VatExemptionReasonId>1</VatExemptionReasonId>
                </Item>
            </Items>
            <TaxGroups>
                <TaxGroup>
                    <NumberOfMatchedInvoiceItems>1</NumberOfMatchedInvoiceItems>
                    <BasePrice>1.00</BasePrice>
                    <BasePriceWithRebateOnly>1.00</BasePriceWithRebateOnly>
                    <BasePriceWithTaxOnly>1.21</BasePriceWithTaxOnly>
                    <BasePriceWithRebateAndTax>1.21</BasePriceWithRebateAndTax>
                    <TaxPercentage>21.00</TaxPercentage>
                    <TaxAmount>0.21</TaxAmount>
                    <RebateAmountBeforeVat>1.00</RebateAmountBeforeVat>
                    <RebateAmountAfterVat>1.21</RebateAmountAfterVat>
                </TaxGroup>
            </TaxGroups>
        </Invoice>
    </env:Body>
</env:Envelope>